//SLIG1067 JOB 'DUPE,8628,PR14',REGION=0M,NOTIFY=&SYSUID
//JOBLIB   DD DSN=AV.BIBGERTT,DISP=SHR
//         DD DSN=AV.BIBGERAL,DISP=SHR
//         DD DSN=DB2A2.R2.DSNLOAD,DISP=SHR
//         DD DSN=SYS1.CEE.SCEERUN,DISP=SHR
//STEP2    EXEC SORTD
//*
//* ***    CLASSIFICA EM ORDEM CGC/FILIAL/CONTROLE DO SACADO
//*
//SORTIN   DD DSN=AV.SLIG.SLIG.CLIENDCL.D1904,
//       DISP=OLD
//SORTOUT  DD DSN=AD.C87.SLIG.CLIATUCL(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(060000,19800),RLSE),
//       DCB=(MX.A,LRECL=0232,RECFM=FB),
//       DATACLAS=PRODX37
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//* ***    Log ICE185A/S0C7 em ICEOUTF = conversao PD no OUTREC (dado invalido
//* ***    em 20,5 ou 25,3 ou 42,5 ou 47,3). Corrigir arquivo na origem ou
//* ***    isolar qual PD falha (rode OUTREC com UMA conversao PD por vez).
//* ***    HASP375: ICE128I LIST=Y gera muito SYSOUT; tente OPTION NOLIST
//* ***    abaixo; se o MF nao aceitar, remova e peça ajuste na PROC/PARMLIB.
//SYSIN    DD *
 SORT FIELDS=COPY
 OUTREC OVERLAY=(180:X'000000000000000000',
                 189:X'0000000000',
                 194:X'0000',
                 196:X'000000000000000000',
                 205:X'0000000000',
                 210:X'0000')
/*
//STEP3A   EXEC PGM=BRAD0002
//ENTRA    DD DSN=*.STEP2.SORT.SORTOUT,
//       DISP=SHR
//SAI      DD DSN=AD.C87.SLIG.CLIENDCL(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(060000,19800),RLSE),
//       DCB=(MX.A,LRECL=0232,RECFM=FB),
//       DATACLAS=PRODX37
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//*
//STEP4    EXEC PGM=SLIG6102
//*
//* ***    UNIFICA REGISTROS ATUALIZANDO VALORES E NOME DO CLIENTE
//*
//PERIDECE DD DSN=AV.SLIG.SLIG.PERTITLO.D1904,
//       DISP=SHR
//CLIENDUP DD DSN=*.STEP3A.SAI,
//       DISP=OLD
//CADACLIE DD DSN=AV.SLIG.SLIG.CADACLIE.D1904,
//       DISP=SHR
//CADACBCL DD DSN=AV.SLIG.SLIG.CADCBCLE.D1904,
//       DISP=SHR
//CLIENUNI DD DSN=AD.C87.SLIG.CLIENUNI(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=(DISCO,40),
//       SPACE=(TRK,(060000,19800),RLSE),
//       DCB=(MX.A,LRECL=0300,RECFM=FB),
//       DATACLAS=PRODX37
//ARQERROS DD DSN=AD.C87.SLIG.NOMERROR(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(000010,0002),RLSE),
//       DCB=(MX.A,LRECL=0109,RECFM=FB)
//SRELCTRL DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
