      *================================================================*
      *                                                                *
      *   I#GMSG01 - AREA DE COMUNICACAO API FORMATACAO DE MENSAGEM    *
      *                                                                *
      *   TAMANHO MINIMO = 559 BYTES, TAMANHO MAXIMO = 1059 BYTES      *
      *                                                                *
      *================================================================*

      *----------------------------------------------------------------*
      *  AREA DE COMUNICACAO - API FORMATACAO DE MENSAGEM              *
      *----------------------------------------------------------------*
           05  GMSG01-COMMAREA.

      *----------------------------------------------------------------*
      *  IDENTIFICADOR DO BLOCO DA COMMAREA      POS. 001-008          *
      *----------------------------------------------------------------*
               10  GMSG01-IDENTIFICADOR     PIC X(008) VALUE 'GMSGF001'.

      *----------------------------------------------------------------*
      *  TAMANHO DO BLOCO DA COMMAREA            POS. 009-013          *
      *----------------------------------------------------------------*
               10  GMSG01-TAM-COMMAREA        PIC  9(005) VALUE 1059.

      *----------------------------------------------------------------*
      *  BLOCO DE RETORNO                        POS. 014-027          *
      *----------------------------------------------------------------*
               10  GMSG01-RETORNO.

      *----------------------------------------------------------------*
      *    RETURN CODE                           POS. 014-015          *
      *----------------------------------------------------------------*
                   15  GMSG01-RETCODE         PIC 9(002).

      *----------------------------------------------------------------*
      *    REASON CODE - DETALHAMENTO DO RETURN CODE   POS. 016-019    *
      *----------------------------------------------------------------*
                   15  GMSG01-REACODE         PIC X(004).

      *----------------------------------------------------------------*
      *    CODIGO DA MENSAGEM EXPLICATIVA        POS. 020-027          *
      *----------------------------------------------------------------*
                   15  GMSG01-CODMENS         PIC X(008).

      *----------------------------------------------------------------*
      *  BLOCO DE ENTRADA                        POS. 028-546          *
      *----------------------------------------------------------------*
               10  GMSG01-ENTRADA.

      *----------------------------------------------------------------*
      *    CODIGO DA MENSAGEM - INFORMACAO OBRIGATORIA  POS. 028-035   *
      *----------------------------------------------------------------*
                   15  GMSG01-CODIGO-MENSAGEM.

      *----------------------------------------------------------------*
      *    PREFIXO DO GRUPO MENSAGEM - INFORMACAO OBRIGATORIA          *
      *                                          POS. 028-031          *
      *----------------------------------------------------------------*
                       20  GMSG01-PREFIXO     PIC X(004).

      *----------------------------------------------------------------*
      *    NUMERO SEQUENCIAL DA MENSAGEM - INFORMACAO OBRIGATORIA      *
      *                                          POS. 032-035          *
      *----------------------------------------------------------------*
                       20  GMSG01-CODIGO      PIC 9(004).

      *----------------------------------------------------------------*
      *    IDIOMA DA MENSAGEM - INFORMACAO OBRIGATORIA POS. 036-040    *
      *----------------------------------------------------------------*
                   15  GMSG01-IDIOMA          PIC 9(005).

      *----------------------------------------------------------------*
      *    RECURSO - INFORMACAO OBRIGATORIA      POS. 041-045          *
      *----------------------------------------------------------------*
                   15  GMSG01-RECURSO         PIC 9(005).

      *----------------------------------------------------------------*
      *    TIPO DE RECURSO 0 - CANAL             POS. 046-046          *
      *    TIPO DE RECURSO 1 - NAO CANAL                               *
      *----------------------------------------------------------------*
                   15  GMSG01-TIPO-RECURSO    PIC 9(001).

      *----------------------------------------------------------------*
      *    LISTA DE PARAMETROS DA MENSAGEM - INFORMACAO OPCIONAL       *
      *                                          POS. 047-546          *
      *----------------------------------------------------------------*
CRM-01             15  GMSG01-PARAMETROS      PIC X(500) VALUE SPACES.

      *----------------------------------------------------------------*
      *  BLOCO DE SAIDA                          POS. 547-1059         *
      *----------------------------------------------------------------*
               10  GMSG01-SAIDA.

      *----------------------------------------------------------------*
      *    TIPO DA MENSAGEM                      POS. 547-551          *
      *----------------------------------------------------------------*
                   15  GMSG01-TIPO            PIC 9(005).

      *----------------------------------------------------------------*
      *    NIVEL DA MESAGEM                      POS. 552-556          *
      *----------------------------------------------------------------*
                   15  GMSG01-NIVEL           PIC 9(005).

      *----------------------------------------------------------------*
      *    TAMANHO DA MENSAGEM FORMATADA         POS. 557-559          *
      *----------------------------------------------------------------*
                   15  GMSG01-TAMTEXTO        PIC 9(003)   VALUE ZEROS.

      *----------------------------------------------------------------*
      *    MENSAGEM FORMATADA                    POS. 560-1059         *
      *----------------------------------------------------------------*
CRM-01             15  GMSG01-TEXTO-MENSAGEM  VALUE SPACES.
                       20  GMSG01-TEXTO       OCCURS 500 TIMES
                                              PIC X(001).
      *
      *----------------------------------------------------------------*
