//SLIG1085 JOB 'SLIG,4975,PR11','I311083',MSGCLASS=Z,SCHENV=BATCH
//JOBLIB   DD DSN=MX.BIBGERAL,DISP=SHR
//         DD DSN=DB2M1.R2.DSNLOAD,DISP=SHR
//         DD DSN=SYS1.CEE.SCEERUN,DISP=SHR
//STEP5    EXEC PGM=SLIG6300,
//       PARM=01
//*
//* ***    BLOQUEIO DO ON-LINE PARA O PRODUTO TITULOS
//*
//SYSIN    DD *
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
