//SLIG1061 JOB 'SLIG,4975,PR11','I311083',MSGCLASS=Z,SCHENV=BATCH
//JOBLIB   DD DSN=MX.BIBGERAL,DISP=SHR
//         DD DSN=SYS1.CEE.SCEERUN,DISP=SHR
//STEP1    EXEC PGM=IEFBR14
//*
//* ***    SOLTA PROCESSAMENTO PIPES JOBS SLIG1062 E SLIG1063
//*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
