//SLIG1079 JOB 'SLIG,4975,PR11','I311083',MSGCLASS=Z,SCHENV=BATCH
//JOBLIB   DD DSN=MX.BIBGERAL,DISP=SHR
//         DD DSN=SYS1.CEE.SCEERUN,DISP=SHR
//STEP1    EXEC PGM=IEFBR14
//*
//* ***    SOLTA PROCESSAMENTO PIPES JOBS
//* ***    SLIG1081, SLIG1082, SLIG1083 E SLIG1084
//*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
