SORT FIELDS=(
    1,3,A,    -> SLIG84-CEMPR-INC
    24,3,D,   -> SLIG84-MAIOR-IC
    50,3,D,   -> SLIG84-IC-DESCONTO
    53,1,D,   -> SLIG84-IC-DESCONTO-NULL
    46,3,D,   -> SLIG84-IC-CAUCIONADA
    49,1,D,   -> SLIG84-IC-CAUCIONADA-NULL
    42,3,D,   -> SLIG84-IC-SIMPLES
    45,1,D,   -> SLIG84-IC-SIMPLES-NULL
    114,9,A,  -> FORA DO LAYOUT I#SLIG84
    23,1,A),  -> SLIG84-CINDCD-PSSOA-SACDO
  FORMAT=BI
