//SLIG0001 JOB 'SLIG,4130,PR11','C942066',MSGCLASS=Z,SCHENV=BATCH
//JOBLIB   DD DSN=MX.BIBGERAL,DISP=SHR
//         DD DSN=SYS1.CEE.SCEERUN,DISP=SHR
//*
//STEP1    EXEC PGM=IEFBR14
//*
//* ***    ESSE JOB DA FORCEJOB NA TABELA SLIG0000
//* ***    JOB  DE  USO DA PRODUCAO UTILIZADO PELO
//* ***    CONTROL-M  ******   NAO DELETAR  ******
//*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*#SOLTA    EXEC MX,  ======> ESSE COMANDO SERA DADO PELO CONTROL-M
//*#       J=SLIG0000
//*#
//*
