//GFCT1142 JOB 'GFCT,4008,PR14','A299565',MSGCLASS=Z,SCHENV=BATCH
//JOBLIB   DD DSN=MX.BIBGERAL,DISP=SHR
//         DD DSN=DB2M1.R2.DSNLOAD,DISP=SHR
//         DD DSN=SYS1.CEE.SCEERUN,DISP=SHR
//STEP1    EXEC SORTD
//*
//* ***    SORT ARQUIVO ADESAO AO PACOTE - GERADO
//* ***     NO GFCT1130(I#GFCTVE)
//* ***    ORDEM: AGENCIA, CONTA TARIFA, DATA EVENTO
//*
//SORTIN   DD DSN=MX.GFCT.GFCT1141.VERCAREN(0),
//       DISP=SHR
//         DD DSN=MX.GFCT.J1141S06.NEXTACOB(0),
//       DISP=SHR
//SORTOUT  DD DSN=MX.GFCT.VERCAREN.ADPACOTE.CLASS(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0300,RECFM=FB)
//SYSIN    DD *
  SORT FIELDS=(47,3,PD,A,50,7,PD,A,23,3,PD,A,
              122,4,CH,A,119,2,CH,A,116,2,CH,A)
  END
//*
//STEP2    EXEC PGM=GFCT1811
//*
//* ***    APLICA REGRAS PARA APURACAO DE CARENCIA
//* ***    PARA ADESAO AO PACOTE
//*
//ADPACOTE DD DSN=*.STEP1.SORT.SORTOUT,
//       DISP=SHR
//FRANQT92 DD DSN=MX.GFCT.GFCT1811.FRANQT92(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0265,RECFM=FB)
//FRANQT41 DD DSN=MX.GFCT.GFCT1811.FRANQT41(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0150,RECFM=FB)
//SEGCOBRA DD DSN=MX.GFCT.GFCT1811.SEGCOBRA(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0300,RECFM=FB)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
//STEP3    EXEC SORTD
//*
//* ***    MERGE ARQUIVO REGISTROS A COBRAR
//*
//* ***    ORDEM: CHAVE TAB.: DT.ENVIO, ROTINA,
//* ***     NUM.ARQUIVO, SEQ.ARQUIVO.
//*
//SORTIN   DD DSN=MX.GFCT.GFCT1809.SEGCOBRA(0),
//       DISP=SHR
//         DD DSN=MX.GFCT.GFCT1696.SEGCOBRA(0),
//       DISP=SHR
//         DD DSN=MX.GFCT.GFCT1141.SEGCOBRA(0),
//       DISP=SHR
//         DD DSN=*.STEP2.SEGCOBRA,
//       DISP=SHR
//SORTOUT  DD DSN=MX.GFCT.VERREGRA(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=(DISCO,30),
//       SPACE=(TRK,(065500,13100),RLSE),
//       DCB=(MX.A,LRECL=0300,RECFM=FB)
//SYSIN    DD *
  SORT FIELDS=(7,4,A,4,2,A,1,2,A,11,4,A,15,2,A,17,6,A),FORMAT=BI
  END
//*
//STEP3A   EXEC SORTD
//*
//* ***    ------------------------------------------------------------
//* ***    TEST DRIVE AVON
//* ***    RETIRA CONTAS ISENTAS DA COBRAN�A
//* ***    ------------------------------------------------------------
//*
//IN1      DD DSN=MX.GFCT.PRV.ISENAVON(0),
//       DISP=SHR
//IN2      DD DSN=*.STEP3.SORT.SORTOUT,
//       DISP=SHR
//OUT      DD DSN=MX.GFCT.J1142S3A.ISENAVON(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(010000,2000),RLSE)
//OUT1     DD DSN=MX.GFCT.J1142S3A.VERREGRA(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=(DISCO,30),
//       SPACE=(TRK,(055000,11000),RLSE)
//SYSIN    DD *
 JOINKEYS F1=IN1,FIELDS=(01,05,A,06,07,A,102,5,A)
 JOINKEYS F2=IN2,FIELDS=(301,05,A,312,07,A,319,5,A)
 JOIN UNPAIRED,F2
 REFORMAT FIELDS=(?,F2:1,300) --> REGISTRO LIMPO
 OUTFIL FNAMES=OUT,                   --> MATCH
        INCLUDE=(01,01,CH,EQ,C'B'),
         OUTREC=(02,300)
 OUTFIL FNAMES=OUT1,                    --> NO MATCH
        INCLUDE=(01,01,CH,EQ,C'2'),
         OUTREC=(02,300)
 SORT FIELDS=COPY
 END
//JNF2CNTL DD *
 INREC FIELDS=(1,300,47,3,PD,TO=ZDF,50,7,PD,TO=ZDF,23,3,PD,TO=ZDF)
//JNF1JMSG DD SYSOUT=*
//JNF2JMSG DD SYSOUT=*
//*
//STEP3B   EXEC PGM=GFCT6885
//*
//* ***    ------------------------------------------------------------
//* ***    TEST DRIVE AVON - CONTAS ISENTAS
//* ***    ARQUIVOS PARA CARGA DAS TABELAS GFCTB092 E GFCTB041
//* ***    ------------------------------------------------------------
//*
//VERFRANQ DD DSN=*.STEP3A.SORT.OUT,
//       DISP=SHR
//FRANQT92 DD DSN=MX.GFCT.J1142S3B.FRAMQT92(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(002290,0458),RLSE),
//       DCB=(MX.A,LRECL=265,RECFM=FB)
//FRANQT41 DD DSN=MX.GFCT.J1142S3B.FRAMQT41(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(002180,0436),RLSE),
//       DCB=(MX.A,LRECL=150,RECFM=FB)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
//STEP3C   EXEC SORTD
//*
//* ***    ------------------------------------------------------------
//* ***    TEST DRIVE CAASP
//* ***    RETIRA CONTAS ISENTAS DA COBRAN�A
//* ***    ------------------------------------------------------------
//*
//IN1      DD DSN=MX.GFCT.PRV.ISECAASP(0),
//       DISP=SHR
//IN2      DD DSN=*.STEP3A.SORT.OUT1,
//       DISP=SHR
//OUT      DD DSN=MX.GFCT.J1142S3C.ISECAASP(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(010000,2000),RLSE)
//OUT1     DD DSN=MX.GFCT.J1142S3C.VERREGRA(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=(DISCO,30),
//       SPACE=(TRK,(055000,11000),RLSE)
//SYSIN    DD *
 JOINKEYS F1=IN1,FIELDS=(01,05,A,06,07,A,102,5,A)
 JOINKEYS F2=IN2,FIELDS=(301,05,A,312,07,A,319,5,A)
 JOIN UNPAIRED,F2
 REFORMAT FIELDS=(?,F2:1,300)           --> REGISTRO LIMPO
 OUTFIL FNAMES=OUT,                     --> MATCH
        INCLUDE=(01,01,CH,EQ,C'B'),
         OUTREC=(02,300)
 OUTFIL FNAMES=OUT1,                    --> NO MATCH
        INCLUDE=(01,01,CH,EQ,C'2'),
         OUTREC=(02,300)
 SORT FIELDS=COPY
 END
//JNF2CNTL DD *
 INREC FIELDS=(1,300,47,3,PD,TO=ZDF,50,7,PD,TO=ZDF,23,3,PD,TO=ZDF)
//JNF1JMSG DD SYSOUT=*
//JNF2JMSG DD SYSOUT=*
//*
//STEP3D   EXEC PGM=GFCT6885
//*
//* ***    ------------------------------------------------------------
//* ***    TEST DRIVE CAASP - CONTAS ISENTAS
//* ***    ARQUIVOS PARA CARGA DAS TABELAS GFCTB092 E GFCTB041
//* ***    ------------------------------------------------------------
//*
//VERFRANQ DD DSN=*.STEP3C.SORT.OUT,
//       DISP=SHR
//FRANQT92 DD DSN=MX.GFCT.J1142S3D.FRAMQT92(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(002290,0458),RLSE),
//       DCB=(MX.A,LRECL=265,RECFM=FB)
//FRANQT41 DD DSN=MX.GFCT.J1142S3D.FRAMQT41(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(002180,0436),RLSE),
//       DCB=(MX.A,LRECL=150,RECFM=FB)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
//STEP4    EXEC PGM=GFCT1812
//*
//* ***    APLICA REGRAS DE DIA DE COBRANCA E RETENCAO
//*
//ENTCOBRA DD DSN=*.STEP3C.SORT.OUT1,
//       DISP=SHR
//SEGCOBRA DD DSN=MX.GFCT.SEGCOBRA(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=(DISCO,20),
//       SPACE=(TRK,(065500,13100),RLSE),
//       DCB=(MX.A,LRECL=0265,RECFM=FB)
//SYSOUT   DD SYSOUT=*
//PRINTER  DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
//STEP5    EXEC SORTD
//*
//* ***    GERA ARQUIVO DE FRANQUEADOS PELA CARENCIA PARA GFCTB092
//*
//* ***    ORDEM: CHAVE TAB.: DT.ENVIO, ROTINA, NUM.ARQUIVO
//* ***    SEQ.ARQUIVO.   *
//*
//SORTIN   DD DSN=MX.GFCT.GFCT1809.FRANQT92(0),
//       DISP=SHR
//         DD DSN=MX.GFCT.GFCT1696.FRANQT92(0),
//       DISP=SHR
//         DD DSN=MX.GFCT.GFCT1141.ISENTO92(0),
//       DISP=SHR
//         DD DSN=*.STEP2.FRANQT92,
//       DISP=SHR
//         DD DSN=*.STEP3B.FRANQT92,
//       DISP=SHR
//         DD DSN=*.STEP3D.FRANQT92,
//       DISP=SHR
//SORTOUT  DD DSN=MX.GFCT.FRANQT92.CARENCIA(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0265,RECFM=FB)
//SYSIN    DD *
  SORT FIELDS=(7,4,A,4,2,A,1,2,A,11,4,A,15,2,A,17,6,A),FORMAT=BI
  END
//*
//STEP6    EXEC SORTD
//*
//* ***    MERGE DE ARQUIVOS DE EVENTOS A COBRAR PARA
//* ***      GFCTB041 I#GFCTV4
//* ***    ORDEM: CHAVE TAB.: DT.ENVIO, ROTINA NUM.ARQUIVO,
//* ***    SEQ.ARQUIVO.
//*
//SORTIN   DD DSN=MX.GFCT.GFCT1809.FRANQT41(0),
//       DISP=SHR
//         DD DSN=MX.GFCT.GFCT1696.FRANQT41(0),
//       DISP=SHR
//         DD DSN=MX.GFCT.GFCT1141.ISENTO41(0),
//       DISP=SHR
//         DD DSN=*.STEP2.FRANQT41,
//       DISP=SHR
//         DD DSN=*.STEP3B.FRANQT41,
//       DISP=SHR
//         DD DSN=*.STEP3D.FRANQT41,
//       DISP=SHR
//SORTOUT  DD DSN=MX.GFCT.FRANQT41.CARENCIA(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0150,RECFM=FB)
//SYSIN    DD *
  SORT FIELDS=(7,4,A,4,2,A,1,2,A,11,4,A,15,2,A,17,6,A),FORMAT=BI
  END
//*
