//GFCT1083 JOB 'GFCT,4008,PR14','A299565',MSGCLASS=Z,SCHENV=BATCH
//JOBLIB   DD DSN=MX.BIBGERAL,DISP=SHR
//         DD DSN=DB2M1.R2.DSNLOAD,DISP=SHR
//         DD DSN=SYS1.CEE.SCEERUN,DISP=SHR
//STEP0    EXEC SORTD
//*
//* ***    CLASSIFICADO POR AGENCIA, CONTA, DATA E PACOTE
//* ***     INCLUINDO CESTAS NEXT DA DIARIA
//*
//SORTIN   DD DSN=MX.GFCT.PRV.ADMESCOR(0),
//       DISP=SHR
//         DD DSN=MX.GFCT.PRV.ADMESCOR.NEXT(0),
//       DISP=SHR
//SORTOUT  DD DSN=MX.GFCT.J1083S00.ADMESCOR(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=(DISCO,18),
//       SPACE=(TRK,(089830,17966),RLSE),
//       DCB=(MX.A,LRECL=0030,RECFM=FB)
//SYSIN    DD *
  SORT FIELDS=(1,3,A,4,4,A,14,5,A,11,3,A),FORMAT=BI
  END
//*
//STEP1    EXEC PGM=GFCT1834
//*
//* ***    IDENTIFICA EVENTOS QUE POSSUEM ADESAO A TARIFA
//* ***    PACOTE
//*
//EVCCOMPO DD DSN=MX.GFCT.EVEADCOR(0),
//       DISP=SHR
//ADESOMES DD DSN=*.STEP0.SORT.SORTOUT,
//       DISP=SHR
//EVCADSAO DD DSN=MX.GFCT.EVCADSAO.MESCOR(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0265,RECFM=FB)
//EVSADSAO DD DSN=MX.GFCT.EVSADSAO.MESCOR(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0265,RECFM=FB)
//PCTADSAO DD DSN=MX.GFCT.PCTADSAO.MESCOR(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0050,RECFM=FB)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
//STEP2    EXEC SORTD
//*
//* ***    SORT POR ORDEM DE TARIFA PACOTE, TARIFA COMPONENTE,
//* ***    E DATA DE INICIO DE PERIODO DE VIGENCIA.
//*
//SORTIN   DD DSN=*.STEP1.PCTADSAO,
//       DISP=SHR
//SORTOUT  DD DSN=MX.GFCT.PCTADSAO.CLASMCOR(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0050,RECFM=FB)
//SYSIN    DD *
 SORT FIELDS=(1,5,A,6,5,A,11,13,A,24,8,A),FORMAT=BI
 END
//*
//STEP2A   EXEC SORTD
//*
//* ***    PREPARACAO PARA EXECUCAO DO JOB GFCT1083,
//* ***    PROGRAMA GFCT1836 COM MES CORRENTE
//* ***    CLASSIFICADO POR PACOTE, COMPONENTE E DATA
//*
//SORTIN   DD DSN=MX.GFCT.PRV.COMPOCOR(0),
//       DISP=SHR
//SORTOUT  DD DSN=MX.GFCT.COMPOCOR.SORT1(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(010000,1000),RLSE),
//       DCB=(MX.A,LRECL=0100,RECFM=FB)
//SYSIN    DD *
 SORT FIELDS=(1,5,A,6,5,A,16,8,A),FORMAT=BI
 END
//*
//STEP3    EXEC PGM=GFCT1836
//*
//* ***    OBTER OS COMPONENTES DE CADA CLIENTE  - MAXIMO DE
//* ***    300 COMPONENTES POR PACOTE.
//*
//PCTADSAO DD DSN=*.STEP2.SORT.SORTOUT,
//       DISP=SHR
//COMTARGE DD DSN=*.STEP2A.SORT.SORTOUT,
//       DISP=SHR
//COMPCLIE DD DSN=MX.GFCT.COMPCLIE.MESCOR(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=(DISCO,30),
//       SPACE=(TRK,(099900,19980),RLSE),
//       DCB=(MX.A,LRECL=100,RECFM=FB)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
//STEP4    EXEC SORTD
//*
//* ***    SORT POR ORDEM DE AGENCIA, CONTA,
//* ***    DATA DE INICIO DE VIGENCIA E TARIFA PACOTE
//*
//SORTIN   DD DSN=*.STEP3.COMPCLIE,
//       DISP=SHR
//SORTOUT  DD DSN=MX.GFCT.COMPERSO.CLASMCOR(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=(DISCO,30),
//       SPACE=(TRK,(099900,19980),RLSE),
//       DCB=(MX.A,LRECL=100,RECFM=FB)
//SYSIN    DD *
 SORT FIELDS=(48,5,A,53,13,A,6,5,A,16,8,A,1,5,A),FORMAT=BI
 END
//*
//STEP4A   EXEC PGM=GFCT1831
//*
//* ***    CALCULO DE EXCEDENTES - CESTA PERSONALIZADA - M�S ANTERIOR
//*
//COMPCLIE DD DSN=*.STEP4.SORT.SORTOUT,
//       DISP=SHR
//COMPERSO DD DSN=MX.GFCT.COMPERSO.PERCOR(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=(DISCO,30),
//       SPACE=(TRK,(099900,19980),RLSE),
//       DCB=(MX.A,LRECL=0100,RECFM=FB)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
//STEP4B   EXEC SORTD
//*
//* ***    SORT POR ORDEM DE AGENCIA / CONTA/
//* ***    DATA DE INICIO DE VIGENCIA E TARIFA PACOTE
//*
//SORTIN   DD DSN=*.STEP4A.COMPERSO,
//       DISP=SHR
//SORTOUT  DD DSN=MX.GFCT.COMPCLIE.CLASMCOR(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=(DISCO,30),
//       SPACE=(TRK,(099900,19980),RLSE),
//       DCB=(MX.A,LRECL=0100,RECFM=FB)
//SYSIN    DD *
 SORT FIELDS=(48,5,A,53,13,A,6,5,A,16,8,A,1,5,A),FORMAT=BI
 END
//*
//STEP5    EXEC SORTD
//*
//* ***    SORT POR ORDEM DE AGENCIA, CONTA
//* ***    E DATA DE OCORRENCIA DO EVENTO
//*
//SORTIN   DD DSN=*.STEP1.EVCADSAO,
//       DISP=SHR
//SORTOUT  DD DSN=MX.GFCT.EVCADSAO.CLASMCOR(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=(DISCO,05),
//       SPACE=(TRK,(019750,03950),RLSE),
//       DCB=(MX.A,LRECL=265,RECFM=FB)
//SYSIN    DD *
 SORT FIELDS=(47,3,A,50,7,A,23,3,A,122,4,A,119,2,A,116,2,A),FORMAT=BI
 END
//*
