//GFCT1085 JOB 'GFCT,4220,PR14','I12808',MSGCLASS=Z,SCHENV=BATCH
//JOBLIB   DD DSN=MX.BIBGERAL,DISP=SHR
//         DD DSN=SA.RDG2.SREST.MZ1.DCALOAD,DISP=SHR
//         DD DSN=DB2M1.R2.DSNLOAD,DISP=SHR
//         DD DSN=SYS1.CEE.SCEERUN,DISP=SHR
//STEP1    EXEC PGM=GFCT1838
//*
//* ***    IDENTIFICACAO DE ISENTOS E EXCEDENTES DE PACOTE
//*
//* ***    ATENCAO ESTE JOB POSSUI SMART RESTART
//* ***    A SEGUIR COMENTARIO SOBRE PROCEDIMENTOS
//*
//* ***    OS DDNAMES DE SAIDA SAO ATUALIZADOS COM *DISP=(,CATLG,CATLG)*
//* ***    PARA QUE EM CASO DE ABEND OS ARQ FIQUEM RESIDENTES E POSSAM
//* ***    SER UTILIZADOS PELO COMPONENTE CHECKPOINT E RESTART.
//*
//* ***    EM CASO DE ABEND NA RETOMADA DEVE SE ALTERAR O PARAMETRO
//* ***    PARA  DISP=OLD  POIS PASSARAH A ATUALIZAR O ARQ. POR VERSAO
//* ***    PARA NAO DESTRUIR OS DADOS QUE SERAO REAPROVEITADOS
//* ***    NO RESTART.
//* ***
//*
//* ***    COMO PROCEDER EM CASO DE ABEND
//* ***    ==============================
//* ***    *PASSO 1 = O PROGRAMA FAZ PARTE DO RESTART AUTOM. CHECKPOINT
//* ***    E RESTART?
//* ***               CONSULTAR NO PRODUTO SMART RESTART (TSO   160)
//* ***    *PASSO 2 = QUE TIPO DE ABEND: SISTEMICO OU DE
//* ***               INFRA-ESTRUTURA
//* ***    *PASSO 3 = ENCAMINHAR O ABEND E A SOLUCAO DO MESMO
//* ***
//* ***    *** ABEND SISTEMICO (PROGRAMA) ***
//* ***    ==================================
//*
//* ***    O ATENDIMENTO DO DDS OU DBA DE PRODUCAO AVALIARA E INFORMARA
//* ***    SE O PROGRAMA UTILIZARA O RESTART (CHECKPOINT RESTART) OU SE
//* ***    INICIARA DO COMECO NOVAMENTE. SE FOR INICIAR DO COMECO DEVE
//* ***    SE EXCLUIR NO SMART RESTART (TSO 160) A CONDI� O DE RESTART
//* ***    E NAO SERA NECESSARIO ALTERAR O JCL.
//* ***    SE FOR DAR SEQUENCIA COM SMART RESTART SEGUIR OS
//* ***    PROCEDIMENTOS ACIMA DESCRITOS
//*
//* ***    *** B37 OU PROCEDIMETOS DE OMIT/INCLUDE COND ETC..
//* ***    ==================================================
//* ***
//* ***    COPIA DO ARQUIVO COM (+1) EM OUTRO JOBNAME/PROCESSO COM
//* ***    ALOCACAO MAIOR QUE A ATUAL SEM DEFINI� O DE RELEASE (RLSE).
//*
//* ***    NA RETOMADA DESINIBIR O CARTAO (QUE DEVE ESTAR COMENTADO)
//* ***    //RAINPUT   DD *
//* ***    REST_NEWDSN(RETURN)
//* ***
//*
//COMPCLII DD DSN=MX.GFCT.COMPCLIE.CLASMCOR(0),
//       DISP=SHR
//EVCADSAI DD DSN=MX.GFCT.EVCADSAO.CLASMCOR(0),
//       DISP=SHR
//EXCED92O DD DSN=MX.GFCT.EXCED92O.MESCOR(+1),
//       DISP=(,CATLG,CATLG),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0265,RECFM=FB)
//ISENT41O DD DSN=MX.GFCT.ISENT41O.MESCOR(+1),
//       DISP=(,CATLG,CATLG),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0150,RECFM=FB)
//ISENT92O DD DSN=MX.GFCT.ISENT92O.MESCOR(+1),
//       DISP=(,CATLG,CATLG),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0265,RECFM=FB)
//EXCEDRES DD DSN=MX.GFCT.EXCEDRES.MESCOR(+1),
//       DISP=(,CATLG,CATLG),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0265,RECFM=FB)
//STGRPSRV DD DSN=MX.GFCT.STGRPSRV.MESCOR(+1),
//       DISP=(,CATLG,CATLG),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0265,RECFM=FB)
//EVNBATEO DD DSN=MX.GFCT.EVNBATEO.MESCOR(+1),
//       DISP=(,CATLG,CATLG),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0265,RECFM=FB)
//ST18T41O DD DSN=MX.GFCT.ST18T41O.MESCOR(+1),
//       DISP=(,CATLG,CATLG),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0150,RECFM=FB)
//ST18T92O DD DSN=MX.GFCT.ST18T92O.MESCOR(+1),
//       DISP=(,CATLG,CATLG),
//       UNIT=DISCO,
//       SPACE=(TRK,(020000,4000),RLSE),
//       DCB=(MX.A,LRECL=0265,RECFM=FB)
//*#//RAINPUT   DD *
//*#REST_NEWDSN(RETURN)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
