      *----------------------------------------------------------------*
      *                      Inicio da Geracao                         *
      *              DICM-CopyBook-Processo Publicacao                 *
      *----------------------------------------------------------------*
      * Copy Book - BVVEW002
      * Data/Hora : 24/Mai/2019 16:44:33
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
      *                       Inicio do Include                        *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
       05 CCNPJ-CPF-FORMT                                      PIC X(20)
           VALUE 'SPACES'.
       05 IEMPRS-ORIGD-FUNDO                                   PIC X(40)
           VALUE 'SPACES'.
       05 IBCO-PRODT-TITLO-COBR                                PIC X(40)
           VALUE 'SPACES'.
       05 CCARCT-IDTFD-MSGEM                                   PIC X(10)
           VALUE 'SPACES'.
       05 CCONTR-RCBVL-CPART                                   PIC X(15)
           VALUE 'SPACES'.
      *----------------------------------------------------------------*
      *                       Final do Include                         *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
      *                       Final da Geracao                         *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
