      *----------------------------------------------------------------*
      *            COMMAREA PARA PROGRAMA BVVEWR20                     *
      *            COMUNICACAO COM A CIP - MENSAGEM RRC0020            *
      *----------------------------------------------------------------*
      *
            05     BVVEWR20-MAPA REDEFINES BVVEWR00-MENSAGEM.
      *            IDENTIFICADOR NEGOCIAÁ„O RECEBÌVEL
              10   BVVEWR20-IDENTDNEGCRECBVL                PIC X(040).
      *            IDENTIFICADOR DA OPERAÁ„O
              10   BVVEWR20-IDENTDOP                        PIC X(019).
      *            SITUAÁ„O DO RESULTADO
              10   BVVEWR20-SITRET                          PIC X(006).
