      *----------------------------------------------------------------*
      *    INC 'BVVEWM21'       PARA CONTER A ERRO-AREA P/ CDES (CD11) *
      *    TAMANHO              520 BYTES                              *
      *                                                                *
      *----------------------------------------------------------------*
      *
           05  BVVEWM21-ERRO-AREA           PIC  X(00520).

