      *----------------------------------------------------------------*
      *            COMMAREA PARA PROGRAMA BVVEWR27                     *
      *            COMUNICACAO COM A CIP - MENSAGEM RRC0027            *
      *----------------------------------------------------------------*
      *
            05     BVVEWR27-MAPA REDEFINES BVVEWR00-MENSAGEM.
      *            IDENTIFICADOR DA OPERAÁ„O DE CONTESTAÁ„O.
              10   BVVEWR27-IDENTDOPCONTSTC                 PIC X(019).
