      *----------------------------------------------------------------*
      *                      Inicio da Geracao                         *
      *              DICM-CopyBook-Processo Publicacao                 *
      *----------------------------------------------------------------*
      * Copy Book - BVVEW004
      * Data/Hora : 24/Mai/2019 16:45:11
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
      *                       Inicio do Include                        *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
       05 CCARCT-IDTFD-MSGEM                                   PIC X(10)
           VALUE 'SPACES'.
       05 CCARCT-IDTFD-MSGEM-C                                 PIC X(10)
           VALUE 'SPACES'.
       05 CCNPJ-CPF-FORMT                                      PIC X(20)
           VALUE 'SPACES'.
       05 IEMPRS-ORIGD-FUNDO                                   PIC X(40)
           VALUE 'SPACES'.
       05 RVLR-DISCT-TRNSF                                     PIC X(30)
           VALUE 'SPACES'.
       05 DLIM-APROV-LCTO-CTBIL                                PIC X(10)
           VALUE 'SPACES'.
      *----------------------------------------------------------------*
      *                       Final do Include                         *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
      *                       Final da Geracao                         *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
