//GFCTC040 JOB 'GFCT,4008,PR14','B587599',MSGCLASS=Z,SCHENV=BATCH
//JOBLIB   DD DSN=MX.BIBGERAL,DISP=SHR
//         DD DSN=DB2M1.R2.DSNLOAD,DISP=SHR
//         DD DSN=SYS1.CEE.SCEERUN,DISP=SHR
//STEP1    EXEC PGM=POOL0262
//*
//* ***    DESCOMPACTA ARQUIVO DE CLIENTES - (LRECL= 180 I#CLIEV20)
//* ***    ORDENANDO POR CAD-AGENCIA E CAD-CONTA.
//*
//SORTIN   DD DSN=MJ.CLIE.PRP.CADNOVGR.ALFA(0),
//       DISP=SHR
//SORTOUT  DD DSN=MX.GFCT.JC040S01.SORTOUTX(+1),
//       DISP=(,CATLG,CATLG),
//       UNIT=DISCO,
//       SPACE=(TRK,(150000,50000),RLSE),
//       DCB=(MX.A,LRECL=0180,RECFM=FB),
//       DATACLAS=PRODX37
//SYSIN    DD *
  SORT FIELDS=(1,3,A,7,4,A),FORMAT=BI
  END
//SORTLIB  DD DSN=SYS1.SORTLIB,
//       DISP=SHR
//SORTWK01 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK02 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK03 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK04 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK05 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK06 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK07 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK08 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK09 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK10 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK11 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK12 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK13 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK14 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK15 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK16 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK17 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK18 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK19 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK20 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK21 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK22 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK23 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK24 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK25 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK26 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK27 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK28 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK29 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK30 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK31 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SORTWK32 DD UNIT=DISCO,
//       SPACE=(CYL,(1500))
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
//STEP2    EXEC PGM=GFCT4306
//*
//* ***    COMPLEMENTA MOVIMENTO COM DADOS CLIE
//*
//CADCLIEN DD DSN=*.STEP1.SORTOUT,
//       DISP=OLD
//ENTMWATO DD DSN=MX.GFCT.JC038S02.SAIMWATO(0),
//       DISP=SHR
//SAIMWATO DD DSN=MX.GFCT.JC040S02.SAIMWATO(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(120000,12000),RLSE),
//       DCB=(MX.A,LRECL=450,RECFM=FB),
//       DATACLAS=PRODX37
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
//STEP3    EXEC PGM=GFCT4307
//*
//* ***    FORMATA MOVIMENTO PARA ENVIO GERA��O DE CR�DITO CELULAR
//*
//ARQDATAS DD DSN=MX.GFCT.PRP.CTRLDATA(0),
//       DISP=SHR
//ENTMWATO DD DSN=*.STEP2.SAIMWATO,
//       DISP=OLD
//GERACRED DD DSN=MX.GFCT.PRP.JC040S03.GERACRED(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(CYL,(000076,0015),RLSE),
//       DCB=(MX.A,LRECL=200,RECFM=FB)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
//STEP4    EXEC SORTD
//*
//* ***    CLASSIFICA E CONCATENA MOVIMENTO ACUMULADO
//* ***    PELA CHAVE DO EVENTO
//*
//SORTIN   DD DSN=MX.GFCT.PRP.J5051S01.WAOTACUM(0),
//       DISP=SHR
//         DD DSN=*.STEP2.SAIMWATO,
//       DISP=OLD
//SORTOUT  DD DSN=MX.GFCT.PRP.J5051S01.WAOTACUM(+1),
//       DISP=(,CATLG,DELETE),
//       UNIT=DISCO,
//       SPACE=(TRK,(120000,12000),RLSE),
//       DCB=(MX.A,LRECL=450,RECFM=FB),
//       DATACLAS=PRODX37
//SYSIN    DD *
 SORT FIELDS=(1,16,A),FORMAT=BI
 END
//*
