      *----------------------------------------------------------------*
      *                      Inicio da Geracao                         *
      *              DICM-CopyBook-Processo Publicacao                 *
      *----------------------------------------------------------------*
      * Copy Book - DCOMW90A
      * Data/Hora : 24/Out/2017 13:09:19
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
      *                       Inicio do Include                        *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
       05 DCOMW90A-CDFORMULARIO                                PIC X(8).
       05 DCOMW90A-OPERACAO                                   PIC 9(13).
       05 DCOMW90A-DATA                                       PIC X(10).
       05 DCOMW90A-FORM                                        PIC X(5).
       05 DCOMW90A-SEQ                                         PIC 9(4).
      *----------------------------------------------------------------*
      *                       Final do Include                         *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
      *                       Final da Geracao                         *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
