      *----------------------------------------------------------------*
      *                      Inicio da Geracao                         *
      *              DICM-CopyBook-Processo Publicacao                 *
      *----------------------------------------------------------------*
      * Copy Book - DCOMWDV1
      * Data/Hora : 27/Abr/2020 08:15:02
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
      *                       Inicio do Include                        *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
       05 DCOMWDV1-NUM-OPER-DES                               PIC 9(13).
       05 DCOMWDV1-TIPO-DESC                                  PIC X(40).
       05 DCOMWDV1-DVCTO-FNAL-OPER                            PIC X(10).
       05 DCOMWDV1-QTDE-PCELA-ATIV                             PIC X(6).
       05 DCOMWDV1-VLR-LIQUID                                 PIC X(22).
      *----------------------------------------------------------------*
      *                       Final do Include                         *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
      *                       Final da Geracao                         *
      *               Campos-CopyBook-Processo Publicacao              *
      *----------------------------------------------------------------*
