      
           05 CTACWSAI-HEADER.
              10 CTACWSAI-COD-LAYOUT       PIC X(08)   VALUE 'CTACWSAI'.        
              10 CTACWSAI-TAM-LAYOUT       PIC X(08)   VALUE 14204.
           05 CTACWSAI-REGISTRO.
              10 CTACWSAI-BLOCO-ENTRADA.
                 15 CTACWSAI-E-MAX-OCORR                PIC 9(02).  